Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 204, 61, 32)       320       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 204, 61, 32)       9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 68, 20, 32)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 68, 20, 64)        18496     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 68, 20, 64)        36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 22, 6, 64)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 22, 6, 128)        73856     
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 22, 6, 128)        147584    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 7, 2, 128)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 7, 2, 128)         147584    
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 7, 2, 128)         147584    
_________________________________________________________________
flatten_1 (Flatten)          (None, 1792)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 256)               459008    
_________________________________________________________________
dense_4 (Dense)              (None, 256)               65792     
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 64)                16448     
_________________________________________________________________
dense_6 (Dense)              (None, 7)                 455       
=================================================================
Total params: 1,123,303
Trainable params: 1,123,303
Non-trainable params: 0
_________________________________________________________________